Revit 2027 API
ParameterTypeId.CurveWallOffset Property
 "Wall offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveWallOffset { get; }
Public Shared ReadOnly Property CurveWallOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveWallOffset {
	ForgeTypeId^ get ();
}
static member CurveWallOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace